[{"categoryId":1,"categoryName":"LAPTOPS","managedImageId":"1235","products":[{"id":5,"productName":"HP Stream - 11-d020nr Laptop","price":179.99,"description":"Work from a happy place with a stylish, affordable, Windows-based PC. Store your content in the cloud for easy access from anywhere you have internet.","productStatus":"Active","managedImageId":"1245"},{"id":2,"productName":"HP Pavilion 15z Laptop","price":549.99,"description":"Redesigned with you in mind, the HP Pavilion keeps getting better. Our best-selling notebook is now more powerful so you can watch more, play more, and store more, all in style.","productStatus":"Active","managedImageId":"1200"},{"id":4,"productName":"HP Spectre x360 - 13-4102dx","price":1399.99,"description":"Stunning, ultra-slim convertible PC with a 360° hinge","productStatus":"Active","managedImageId":"1400"},{"id":1,"productName":"HP Pavilion 15t Touch Laptop","price":519.99,"description":"Redesigned with you in mind, the HP Pavilion keeps getting better. Our best-selling notebook is now more powerful so you can watch more, play more, and store more, all in style.","productStatus":"Active","managedImageId":"1100"},{"id":10,"productName":"HP Chromebook 14 G1(ES)","price":1261.99,"description":"Introducing the next generation HP EliteBook Folio 9480m Ultrabook™[2]. Timeless, ultra slim profile in an all metal design with optional 4G Broadband wWAN, and 4th Generation Intel® Core™ Processing Technology.","productStatus":"Active","managedImageId":"1250"},{"id":6,"productName":"HP ENVY x360 - 15t Laptop","price":699.99,"description":"We took our remarkable 360° convertible PC and enhanced it with premium features to give you ultimate flexibility and enviable looks.","productStatus":"Active","managedImageId":"1600"},{"id":7,"productName":"HP ENVY - 17t Touch Laptop","price":849.99,"description":"We took our remarkable 360° convertible PC and enhanced it with premium features to give you ultimate flexibility and enviable looks.","productStatus":"Active","managedImageId":"1700"},{"id":9,"productName":"HP Chromebook 14 G1(ENERGY STAR)","price":299.99,"description":"This HP notebook is all about getting the perfect combination of design, reliability, and features. Style and productivity while keeping your wallet in mind - now that's something to get excited about.","productStatus":"Active","managedImageId":"1249"},{"id":11,"productName":"HP Pavilion x360 - 11t Touch Laptop","price":319.99,"description":"There’s no limit to what this value-packed convertible PC can do. Easily convert from notebook to stand to tent to tablet mode. It’s an app-loving, friend-connecting, 360°-bending machine.","productStatus":"Active","managedImageId":"11100"},{"id":3,"productName":"HP Pavilion 15z Touch Laptop","price":449.99,"description":"Redesigned with you in mind, the HP Pavilion keeps getting better. Our best-selling notebook is now more powerful so you can watch more, play more, and store more, all in style.","productStatus":"Active","managedImageId":"1300"},{"id":8,"productName":"HP ZBook 17 G2 Mobile Workstation","price":1799.0,"description":"On the go creativity knows no limits on a vivid 17.3 inch diagonal HP ZBook 17 G2. Showcase your best work in the office or on the go and take advantage of HP’s most powerful processing, graphics, simple scalability, and blazing-fast connectivity to perform and collaborate at the speed of creativity.","productStatus":"Active","managedImageId":"1800"}]},{"categoryId":2,"categoryName":"HEADPHONES","managedImageId":"1234","products":[{"id":15,"productName":"Beats Studio 2 Over-Ear Matte Black Headphones","price":179.99,"description":"The world’s most famous headphone has been completely redesigned and reimagined. The new Beats Studio® is lighter, sexier, stronger, and more comfortable, with precision sound, Adaptive Noise Canceling, a 20-hour rechargeable battery, and RemoteTalk™. It has all the energy and excitement you expect from Beats, plus a powerful, reengineered sound.","productStatus":"Active","managedImageId":"2200"},{"id":14,"productName":"Logitech USB Headset H390","price":39.99,"description":"Features on this product will exceeded your expectations.","productStatus":"Active","managedImageId":"2400"},{"id":12,"productName":"HP H2310 In-ear Headset","price":13.99,"description":"Enjoy an acoustic concert in your ears with HP’s In-Ear Headset H2310. Available in trend-setting design in four color options and compatible with most smartphones, MP3 players and tablets – including Android™ and Apple®. Easily switch from jamming to tunes to connecting with friends using the inline microphone. Quality craftsmanship, value priced, and awesome sound.","productStatus":"Active","managedImageId":"2100"},{"id":13,"productName":"Bose SoundLink Around-ear Wireless Headphones II","price":279.95,"description":"Wireless freedom meets best-in-class sound.","productStatus":"OutOfStock","managedImageId":"2300"}]},{"categoryId":3,"categoryName":"TABLETS","managedImageId":"1236","products":[{"id":18,"productName":"HP Pro Tablet 608 G1","price":479.0,"description":"Transform your business with this small stylish business tablet equipped with a brilliant, high definition display and the pervasive connectivity to mobilize nearly any business process. Choose from an expansive choice of accessories[2] for a customized experience.","productStatus":"Active","managedImageId":"3300"},{"id":17,"productName":"HP Elite x2 1011 G1 Tablet","price":1279.0,"description":"Ultrabook™[2] Power\nPower up for ultimate power with Windows 8.1,[1] 5th Gen Intel® Core™ M processors,[4] with optional vPro™[5] and long battery life provided by dual tablet and keyboard base batteries.","productStatus":"Active","managedImageId":"3200"},{"id":16,"productName":"HP ElitePad 1000 G2 Tablet","price":1009.0,"description":"More than a tablet—a total business solution. The elegant and sleek HP ElitePad 1000 G2 has the performance and flexibility to transform the way you work. Redefine productivity and stay light with the confidence of the leading manageability, security, and support you expect from HP.","productStatus":"Active","managedImageId":"3100"}]},{"categoryId":4,"categoryName":"SPEAKERS","managedImageId":"1237","products":[{"id":22,"productName":"HP Roar Wireless Speaker","price":84.99,"description":"Showcase your music anywhere with the ease of wireless Bluetooth® connectivity.","productStatus":"Active","managedImageId":"4400"},{"id":24,"productName":"HP Roar Mini Wireless Speaker","price":44.99,"description":"Attention-getting design, color, and sound - the HP Roar Mini Wireless Speaker. Exceptional size-defying audio while streaming music and calls from a distinctively compact speaker.","productStatus":"Active","managedImageId":"4600"},{"id":23,"productName":"Logitech X100 Speaker System - Wireless Speaker(s)","price":49.99,"description":"Pump up the volume and enjoy crystal-clear sound from this mobile speaker. This portable speaker is perfect for life on-the-go. Take it on the road or relax and listen at home because this mobile speaker goes everywhere. Simple, intuitive design lets you wirelessly connect and stream music from your Bluetooth-enabled device from up to 30' away. Easily manage phone calls and volume control from your mobile phone. Enjoy five hours of continuous play before you need to recharge. Recharge the built-in, lithium-ion battery with the convenience of the included micro-USB cable.","productStatus":"Active","managedImageId":"4500"},{"id":25,"productName":"Bose SoundLink Wireless Speaker","price":129.0,"description":"If music is your motivation, wait until you hear the SoundLink® Color Bluetooth speaker. It plays your favorite tunes from your favorite Bluetooth device-out loud in clear, full audio-just about anywhere you want to go. It's small, durable and simple to use. And it comes in a spectrum of colors to match almost any style.","productStatus":"Active","managedImageId":"4700"},{"id":21,"productName":"HP Roar Plus Wireless Speaker","price":169.99,"description":"Showcase your music anywhere with the ease of wireless Bluetooth® connectivity.","productStatus":"Active","managedImageId":"4300"},{"id":20,"productName":"Bose Soundlink Bluetooth Speaker III","price":269.99,"description":"Meet the speaker that brings your music and friends together-with a style that's all your own. The SoundLink® Bluetooth speaker III is our best-performing mobile Bluetooth speaker. It plays louder and longer than its popular predecessor, with advanced Bose® technologies that reproduce the fullness, clarity and depth of your music. And a colorful assortment of optional covers let you personalize your speaker.","productStatus":"Active","managedImageId":"4200"},{"id":19,"productName":"HP S9500 Bluetooth Wireless Speaker","price":200.0,"description":"Impress … everyone! Futuristic design with perforated steel formed into subtle angles. Requiring only minimal space, this speaker is the ideal complement to any setting.","productStatus":"Active","managedImageId":"4100"}]},{"categoryId":5,"categoryName":"MICE","managedImageId":"1238","products":[{"id":30,"productName":"HP Z4000 Wireless Mouse","price":9.99,"description":"The sleek and low-profiled design make the Z4000 the must-have companion to every thin notebook or tablet. Style and comfort within a dynamic ultra-mobile wireless mouse.","productStatus":"Active","managedImageId":"5505"},{"id":34,"productName":"Microsoft Sculpt Touch Mouse","price":49.99,"description":"Looking for a portable mouse that helps you get things done? Sculpt Touch Mouse saves time in long documents and works virtually anywhere, with no cables or transceivers to connect. And it's designed to fit comfortably in either hand.\nThe four-way touch scrolling pad on the Sculpt Touch Mouse lets you breeze up and down, left and right, and through windows and documents with just the swipe of your finger. While you scroll, you'll feel the nice surprise of tactile feedback. Sculpt Touch Mouse is also a powerful complement to Windows 8, navigating fluidly and intuitively around the Start Screen.\n","productStatus":"Active","managedImageId":"5900"},{"id":26,"productName":"Kensington Orbit 72352 Trackball","price":59.99,"description":"The Kensington Orbit Wireless Mobile Trackball offers a precise, compact and versatile experience with a centered-ball design. With no wires to tie you down, the 2.4 GHz wireless with storable nano receiver works wherever you do -- at your home or office. And the unique touch scrolling lets you glide effortlessly through web pages and documents.","productStatus":"Active","managedImageId":"5100"},{"id":33,"productName":"HP Z8000 Bluetooth Mouse","price":50.99,"description":"The exquisite HP Z8000 Bluetooth Mouse is only 18mm (.7in) height, saves power with Bluetooth® Low Energy connectivity, and provides effortless capacitive touch control. The future is here.","productStatus":"Active","managedImageId":"5800"},{"id":29,"productName":"HP USB 3 Button Optical Mouse","price":9.99,"description":"Smooth and Accurate - The HP USB 3-Button Optical Mouse is the affordable desktop optical mouse solution that combines functionality with style","productStatus":"Active","managedImageId":"5400"},{"id":32,"productName":"Kensington Orbit 72337 Trackball with Scroll Ring","price":39.99,"description":"All-day comfort and scrolling come together in the Kensington Orbit Trackball with Scroll Ring. The scroll ring allows you to fly through web pages and documents. And all while delivering comfort and space savings no mouse can match.","productStatus":"Active","managedImageId":"5700"},{"id":27,"productName":"HP Z3600 Wireless Mouse","price":15.99,"description":"The tiny HP Wireless Mouse Z3600 provides stylish comfort and control for your mobile computing needs. With optical tracking, 3 button controls, and the freedom to connect up to 30ft (10m) away, this compact mouse provides oversized performance.","productStatus":"Active","managedImageId":"5200"},{"id":31,"productName":"Logitech G502 Proteus Core","price":79.99,"description":"MAKE IT YOURS!\nProteus Core perfectly tuned by you.\nProteus Core allows you to change the weight, balance, and enables you to adapt to wherever you choose to play. Customize it to the way you game and make it yours!\n\nPERSONALLY-TUNED PERFORMANCE\nAdapts to your environment\nFine tune the optical sensor in Proteus Core to your playing surface for better accuracy, precision and responsiveness. A quick tuning process, and you are battle ready.","productStatus":"Active","managedImageId":"5600"},{"id":28,"productName":"HP Z3200 Wireless Mouse","price":29.99,"description":"The HP Wireless Mouse Z3200 provides powerful Blue LED optical tracking. Its ambidextrous shape and familiar button controls are easy to use. Compact contoured control.","productStatus":"Active","managedImageId":"5300"}]}]